require('dotenv').config();

module.exports = {
  token: "MTUyMzA2MTQ3NTE2ODYxNjYwOQ.GXrRA4.vlfn4Gx1bf9LeRU5YRONF0lrJ4Xi7KoC6O_EnY",
  clientId: "1523061475168616609",
  prefix: "!",
  ownerID: "1363178020621254776",
  embedColor: '#2b2d31',
  jailColor: '#1a1a2e',
  successColor: '#00b894',
  errorColor: '#d63031',
  warncocronColor: '#fdcb6e',
  jailRoleId : null,
  jailMuteRoleId : null,
  systemEnabled: true,

  autoRoles: {
    memberRole: "1464626187895705896",
    botRole: "1464636524598526002"
  },

  tickets: {
    specialRolesTicket: "1510067123857133698"
  },

  reactRoles: [
    {
      name: "الرتبة الأولى",
      id: "1498604844624384021",
      text: 5,
      voice: 0,
      perms: "إرسال الصور"
    },
    {
      name: "الرتبة الثانية",
      id: "1498604881848570006",
      text: 10,
      voice: 5,
      perms: "لا يوجد + صلاحيات الرتبة السابقة"
    },
    {
      name: "الرتبة الثالثة",
      id: "1464626457924993203",
      text: 25,
      voice: 15,
      perms: "تغيير اسمك في السيرفر + صلاحيات الرتب السابقة"
    },
    {
      name: "الرتبة الرابعة",
      id: "1464628469752135721",
      text: 35,
      voice: 25,
      perms: "رتبة خاصة لك + صلاحيات الرتب السابقة"
    },
    {
      name: "الرتبة الخامسة",
      id: "1464626187895705896",
      text: 60,
      voice: 40,
      perms: "إضافة ستكر للسيرفر (يحذف إذا استخدامه قليل) + صلاحيات الرتب السابقة"
    }
  ],

  buyRoles: [
    {
      name: "الرتبة الأولى",
      id: "1506799402189324328",
      price: 1000000
    },
    {
      name: "الرتبة الثانية",
      id: "1506799506421977218",
      price: 5000000
    },
    {
      name: "الرتبة الثالثة",
      id: "1506799512159522846",
      price: 15000000
    }
  ],

  badWordsSystem: {
    enabled: true,
    whitelistRoleId: "1504930210171191377",
    blockedWords: [
      "كس","كسم","كسمك","قحبة","قحبه","قحاب","انيك","نيك","منيك","خنيث","مخنث","لوطي","لواط",
      "طيز","طيزك","زب","زبك","عير","عيرك","عرص","عرصك","شرموط","شرموطة","شرموطه","متناك",
      "متناكة","متناكه","متناكين","ممحون","ممحونة","ممحونه","مص","مصه","مصك","مص زبي","مص زبك",
      "مص زبه","صدر","صدرك","حلمة","حلمات","حلمتك","كسختك","كسختها","كسختو","خرق","خرا",
      "خرا عليك","خرا فيك","خرا في وجهك","كلب ابن كلب","امك","أمك","ابوك","أبوك","اختك","أختك",
      "اخوك","أخوك","يلعن","يلعن امك","يلعن أبوك","يلعن شرفك","يلعن عرضك","يلعن خيرك",
      "يلعن خير أهلك","يلعن دينك","يلعن دين امك","يلعن دين أبوك","يلعن دين أهلك","اسود",
      "يا اسود","عبد","يا عبد"
    ]
  },

  antiLinks: {
    enabled: true,
    whitelistRoleId: "1506017896105775226"
  }
};
